Tekla.Structures.Drawing.DrawingType
The type of Drawing

Tekla.Structures.Drawing.DrawingType.DOT_GR_UNKNOWN_DRAWING
Unknown Drawing type

Tekla.Structures.Drawing.DrawingType.DOT_GR_GA_DRAWING
General Arrangement Drawing

Tekla.Structures.Drawing.DrawingType.DOT_GR_SINGLE_PART_DRAWING
Single part Drawing

Tekla.Structures.Drawing.DrawingType.DOT_GR_ASSEMBLY_DRAWING
Assembly Drawing

Tekla.Structures.Drawing.DrawingType.DOT_GR_MULTI_DRAWING
Multi Drawing

Tekla.Structures.Drawing.DrawingType.DOT_GR_CAST_UNIT_DRAWING_BY_ID
Cast Unit Drawing by id

Tekla.Structures.Drawing.DrawingType.DOT_GR_CAST_UNIT_DRAWING_BY_POSITION
Cast Unit Drawing by position

Tekla.Structures.Drawing.DrawingType.DOT_GR_ANNOTATION_DRAWING
Annotation drawing